{
    "HomeScreen": [{
        "Heading": "Welcome to my website",
        "Text": "This is My website, welcome to it",
        "Parallax": {"file": "src/assets/imgs/me.png", "size": {"height": "500px"}}
        },
        {
            "Text": "Game design has been my passion for many years, and continues to be, and its one passion i cannot throw away or discard"
        },
        {
            "Heading": "Welcome to my website",
            "Text": "This is My website, welcome to it",
            "Parallax": {"file": "https://wallpapercave.com/wp/wp3988340.jpg", "size": {"height": "500px"}, "overlay": {"top": "10px", "bottom": "-250px"}}
        }
    ]

    ,

    "LevelTemplate": [{
        "Heading": "My first game",
        "Text": "This is my game,This is my game,This is my game,This is my game,This is my game,This is my game,This is my game",
        "Img": {"file": "https://wallpapercave.com/wp/wp3988340.jpg", "alt": "Image of code", "size": {"width": "50%", "height": "50%"}},
        "Video": {"file": "https://www.youtube.com/embed/g4UzKu0_Fqo?si=BLLNkH8ngCUmg94B", "size": {"width": "50%", "height": "50%"}},
        "Parallax": {"file": "https://wallpapercave.com/wp/wp3988340.jpg", "size": {"height": "500px", "width":"50vw"}, "position": {"left": "0px", "centeringPosition": "left"}, "overlay": {"top": "10px", "bottom": "-250px"}}
        },
        {
            "Heading": "My second game",
            "Text": "This is my game,This is my game,This is my game,This is my game,This is my game,This is my game,This is my game"
        }
    ]

    ,

    "GGJ23": [{
        "Heading": "A root cause worth fighting 4",
        "Text": "This was my first team project, that I brought from a terrible state, to a somewhat working state, by myself."
    } ,
    {
        "Heading": "The Game",
        "Text": "The game mainly consists of a simple menu system and a set of enemies that walk in from the right hand of the screen towards the player on the left, the player has a simple point and click bullet that they can defend themself with, and they lose the game if the enemy reaches the left hand of the screen.",
        "Img": {"file": "src/assets/imgs/GGJ23 Menu.png", "alt": "Image of main menu", "size": {"width": "50%", "height": "50%"}},
        "Video": {"file": "https://www.youtube.com/embed/hJf3YGWnjVk", "size": {"width": "80%", "height": "600px"}}
    } ,
    {
        "Heading": "My contribution",
        "Text":"Having learned how to make a console based calculator, to make a full on Game was a Huge step up. I was working in a group of 3 (including myself). I was mainly assigned the role of making assets in the game and working on the main menu. We ended up making the game within a space of 48 hours, including team introductions and planning. On the last day I ended up being left alone as my team couldnt attend the event."
    },
    {
        "Text":"The game when it was left to me, had one type of enemy (as my team couldnt figure out how to make a flying one) no assets, and unfinished collision and damage systems, All of which I had to implement. This meant within the space of 3/4 hours I had to make a functional game."
    },
    {
         "Heading": "What I Learned",
        "Text":"During this event, due to me having to finish the game, I learned how to work under pressure. I also learned how to read code I had no understanding of, and understand it enough on how to fix it, improve it and how to implement new features."
   }
    ]
    ,

    "CraftingGame": [{
        "Heading": "Crafting Game",
        "Text": "The spring interactive project that I went above and beyond on.",
        "Parallax": {"file": "src/assets/imgs/CraftingGameScreenShot.png", "size": {"height": "500px", "width": "100%"}}
    },
    {
        "Heading": "The Game",
        "Text": "This game is a simple demonstration of a crafting game in which the main goal is to craft a pickaxe. This was the first time i experimented with Arrays of Objects, and it is possible to see that some object cards dissapear after you craft a new item, At this point I didnt know how to fix this issue."
    } ,
    {
        "Heading": "My Work",
        "Text" : "In this project the original task was simple, to create a simple system that changes something on the screen. I decided that Id make a full crafting system. "
    },
    {
        "Heading": "What I Learned",
        "Text":"During this project I learned of the intricacies of making systems that can be adapted to different games and have a modular design which reacts to the user and creates what the player should expect."
     },
     {
        "Heading": "Basic Demo: ",
        "Video": {"file": "https://www.youtube.com/embed/ctGrYI9MGwg", "size": {"width": "80%", "height": "600px"}}
     }
    ] ,
    "ZombieShooter": [{
        "Heading": "Zombie Shooter Survival",
        "Text": "A personal Project, Which Ive tried more than once to perfect",
        "Parallax": {"file": "src/assets/imgs/OriginalZombieShooterScreenShot.png", "size": {"height": "500px", "width": "100%"}}
    },
    {
        "Heading" : "Image Above",
        "Text" : "The image above is a basic showing of how the game looks in debug mode, the black lines representing the enemies movement path, The red line representing the vector to the cursor (shoot path), and the blue line showing the explosive enemies move line."
    },
    {
        "Heading": "The Game",
        "Text": "This game has a lot to unpack. So, to begin with it has a functional wave system of spawning enemies in ramping difficulty, Explosive enemies that explode when they are close enough to you causing immense damage to both the player, and other enemies, but they run on screen and wait for 3 seconds before running at you giving you some time to react to them, So kill them quick before they start running. A basic Enemy that runs at you and also damages you with a health pool and different random speeds, a damage system involving collisions between player / enemies, bullet collision system with enemy and a reload mechanism for the basic weapon that the player wields."
    },
    {
        "Heading": "What I Learned",
        "Text":"During this game I learned what it takes to make many complex systems. I had so many things That I wanted to do, but it all came together to making a game that felt Fun, and rewarding for the player."
     },
     {
        "Heading": "Basic Demo: ",
        "Video": {"file": "https://www.youtube.com/embed/paQ-atpKDac", "size": {"width": "80%", "height": "600px"}}
     }
    ] ,
    "TileZombies": [
        {
            "Heading": "Zombie Shooter Project",
            "Text": "Soon after I finished my first project, I found out that what I had done was to be an assignment for my Programming Class.",
            "Parallax": {"file": "src/assets/imgs/ZombieShooter2Screen.png", "size": {"height": "500px", "width": "100%"}}
        },
        {
            "Heading": "The Game",
            "Text": "This game consists of some similar principles to the previous zombie game, such as waves, runner zombies, bullets, bullet collisions and enemy health. This one however has been built from the ground up to follow some of the project guidlines. These guidlines were simple, the game must have 2 enemies, player loss condition and a main menu. This project was going on at a similar time to another big project so I had a lot on my plate. I still however managed to explore some new sytems that I had been thinking about. This game contains my first experience with complex collisions between obstacles, A main staple in more or less every game . . . Ever. This collision system was not in the project brief but I believed it to be a good idea to try to make for the fun of it. The second enemy also has some quite complex logic, It finds the furthest corner from the player on the obstacle closest to it, and then walks straight to it and begins shooting at the player, This makes the game extremely difficult and hard to achieve a high score on. There too is an Instruction screen, animated assets, enemy health bars, player health bar, a more complex and fun wave system. The main piece that I learned from this still being the complex collision system with the obstacle which pushes the player out of the obstacle in the current direction of travel. This system I came to find is common in many collision systems, but one that I had come up with on my own at the time."
        },
        {
            "Heading": "What I Learned",
            "Text":"Collisions. The main grasp I got was the complex system known as movement collisions. I also managed a lot of time management as I was working on 3 other projects at the same time as this one which is further outlined in the Joint Project."
         },
         {
            "Heading": "Basic Demo: ",
            "Video": {"file": "https://www.youtube.com/embed/1U9aHqbmdMQ", "size": {"width": "80%", "height": "600px"}}
         }
    ],
    "DungeonAdventure": [
        {
            "Heading": "The Dungeon Adventure",
            "Text": "The Project with Many moving parts, where I did most of the coding.",
            "Parallax": {"file": "src/assets/imgs/DungeonAdventureProject.png", "size": {"height": "500px", "width": "100%"}}
        },
        {
            "Heading": "The Game",
            "Text": "During this game I followed a Design Document for the creation. The game consists of 2 levels and 4 mini games which you must complete before you run out of lives (working lives system). There is a scrolling maze, clicker puzzle, spot the difference, and riddle. The game also involves a working shop which has working potions(useable in game) An upgraded sword, and a pickaxe which alows the player to exit a level immediately (without solving puzzles). There is also an enemy system where they approach you to try stop you from doing puzzles when you get too close. there is also a Working sword to defend yourself from the enemies. This complex game was unfortunately unfinshed in some small aspects. This huge game was the most complex game from our year."
           },
           {
            "Heading": "Puzzles",
            "Text": "The maze was the most complex Coding challenge, as it had a tile system for the walls of the level, a scrolling level (we had not learned this yet, and I was not aware of views, so I did reverse object movement) This also involved a more refined version of collision system I used in my second zombie game. The riddle game had an implementation designed for ease of use to create new levels. The clicker puzzle was a way of making some cash. The spot the difference puzzle is a fun little challenge for the player."
           },
        {
            "Heading": "My Role",
            "Text": "My role was to do most of the programming, the only aspects I had not done were the asset implementation, the clicker puzzle, and the spot the difference. I spent a lot of time making a fully functional shop with an implemented inventory system for it. I ended up with over 60% project contribution (A lot was going for art, which I was not doing)."
           },
        {
            "Heading": "What I Learned",
            "Text": "That sometimes in a project, the last 5% makes the game about 50% better, as the game would be more finished anda much more enjoyable experience for the player. I also learned that I should add more comments if Im working on a group Project, as I recieved many complaints of complicated code, which mainly happened because I had Waaaaaaay to many very complex systems to do, in a short amount of time."
           },
         {
            "Heading": "Basic Demo: ",
            "Video": {"file": "https://www.youtube.com/embed/Sw1jbowbCrU", "size": {"width": "80%", "height": "600px"}}
         }
    ]
}